<template>
  <div>
    <v-header></v-header>
    <div style="width: 80%; margin: 0 auto">
      <Row :gutter="30">
        <Col span="2">
          <Anchor show-ink style="font-size: 13px">
            <AnchorLink href="#detail" title="详情"/>
            <AnchorLink href="#date" title="可定日期"/>
            <AnchorLink href="#position" title="位置"/>
            <AnchorLink href="#needtoknow" title="须知"/>
            <AnchorLink href="#hostmessage" title="房主信息"/>
          </Anchor>
        </Col>
        <Col span="18">
          <div id="detail">
            {{this.house.city}}·{{this.house.type}}
            <div><strong style="font-size: 25px;">{{this.house.name}}</strong></div>
              <ul class="info"><li><Icon type="ios-home"/>{{this.house.bedroom}}间卧室</li>
                <li><Icon type="md-beaker"/>{{this.house.bed}}张床</li>
                <li><Icon type="md-pint"/>{{this.house.toilet}}间厕所</li>
                <li><Icon type="md-contacts"/>最多容纳{{this.house.guest}}个人</li>
              </ul>
            <br>
            <br>
            <Input :rows="20" readonly style="font-size: 18px;" type="textarea" v-model="this.house.introduction"/>
          </div>
          <br>
          <br>

          <div id="date">
            <div><strong style="font-size: 25px;">可订日期</strong></div>
            <br><br><br><br><br><br>
          </div>

          <div id="position">
            <div><strong style="font-size: 25px;">位置信息</strong></div>
            <baidu-map center="北京" class="map" style="display: flex; flex-direction: column">
              <bm-view style="width: 100%; height:300px; flex: 1"></bm-view>
            </baidu-map>
            <br><br><br><br><br><br><br><br><br><br>
          </div>

          <div id="needtoknow">
            <div><strong style="font-size: 25px;">入住须知</strong></div>
            <br><br><br><br><br><br><br><br><br>
          </div>

          <div id="hostmessage">
            <div><strong style="font-size: 25px;">房主信息</strong></div>
            <br><br><br><br><br><br><br><br><br><br><br><br><br>
          </div>

        </Col>
        <Col span="4">
          <Affix :offset-top="0">
            <Card :bordered="false">
              <p slot="title">Borderless card</p>
              <p>Content of card</p>
              <p>Content of card</p>
              <p>Content of card</p>
            </Card>
          </Affix>
        </Col>
      </Row>
    </div>

  </div>
</template>

<script>
  import Header from '../components/Header'

  export default {
    name: "HouseInfo",
    data() {
      return {
        house:{
          name:'北京胡同人家——闹中取静的乾隆赐第旧址',
          province:'北京',
          city:'北京',
          type:'整间阁楼',
          guest:4,
          bedroom : 2,
          bed : 3,
          toilet : 2,
          jingdu:39.92176,
          weidu:116.42238,
          introduction: '房子位于北京旧城区东四南大街安静的胡同里,是胡同平房院落中的一间｡进院门后左转第二间既是｡从这里轻松步行可达地铁5号线､6号线东四站,2号线､6号线朝阳门站｡距离故宫､景山､北海不远(约3200米)｡清晨可去景山､北海看日出,傍晚到护城河边欣赏故宫角楼的落日余晖｡房间为上下两层(Loft),上层是两间半封闭的阁楼,下层是起居室,有独立卫生间｡房间可供4人居住｡房间内外的照片,以及周围环境的照片有些是我自己照的,虽然不专业但却真实,为房客预订时作为参考｡\n' +
            '\n' +
            '这里是北京旧城区的老式平房,改造后把房间分成上下两层,下层为活动空间,上层是两个独立的阁楼作为卧室,各有楼梯上下｡阁楼因为高度所限,一侧放双人床垫,另一侧放两个单人床垫｡注意:因为房子是北京旧平房改造的,阁楼高度有限,最高处仅为1.8米,在阁楼上请注意安全,小心碰头｡房间可供4人住宿｡下层有一个两用沙发,宽1.4米,打开后可供1或2人住宿｡请老人和儿童上下楼梯时注意安全｡如果老人与儿童上下楼梯不方便,可以使用楼下的两用沙发｡我住的地方距离礼士胡同不远,步行10分钟｡白天一般不在家,有事请打电话,我很快就会过来｡如果需要,我很愿意为房客提供一些关于北京旅游的建议｡此处虽然距离东单､王府井这些繁华商业区很近(公共汽车两站,步行15—20分钟),胡同中依然保留着老北京市民的的生活气息,少有游客,闹中取静,生活方便｡清晨可以到北海､景山看日出,傍晚可到筒子河边欣赏故宫角楼的落日余晖,晚上可到北京人艺剧场看《茶馆》｡漫步在北京的大街小巷,品尝中国各地的风味美食｡这些体验是晚上住酒店,白天乘车直达某个旅游景点的人所无法得到的｡步行10分钟可到地铁5号线与6号线的换乘站东四站(C口 东南口),步行12分钟可到6号线与2号线的换乘站朝阳门站(H口 西南口)｡从机场到礼士胡同可以坐机场快轨到东直门站,换乘2号线到朝阳门站,出H口,步行向西到朝阳门南小街再向南即可到礼士胡同东口,用时10分钟,2分钟后即可到达礼士胡同43号｡如果从机场坐出租车,请出租车司机走朝阳门南小街,第一个路口右转就是礼士胡同,从礼士胡同东口进入(礼士胡同是单行线,汽车只能从东往西),进胡同不远有礼士宾馆(路南)和北京市财贸管理干部学院(路北),43号就在这两个大楼的西侧路北｡想要游览故宫､景山､北海的朋友,可以在东四乘坐公交车,3站地即达;去天坛可乘110或者地铁5号线直达;前往颐和园可乘地铁6号线再换乘地铁4号线即可｡想要逛街的朋友,出礼士胡同西口就是东四南大街,向南(公共汽车两站,步行15—20分钟)即可抵达东单､王府井这些繁华商业区｡东四大街南北都是商铺､餐馆,可以慢慢逛｡想去簋街的朋友,在东四乘坐106路无轨电车可直达｡ 为保护环境,减少浪费,本店不提供一次性用品｡附近有连锁超市(朝阳门与东四都有),生活用品和食品都有,购物非常方便｡东四有麦当劳,好利来西饼屋,朝阳门内大街有必胜客外卖(汉庭酒店附近);朝阳门南小街有很多风味小吃店｡\n' +
            '\n' +
            '空调､冰箱､淋浴房､小型波轮洗衣机､Wi-Fi､歌华有线电视机顶盒､电视机､电水壶､电咖啡壶､微波炉､煮蛋器､小电热锅､多士炉｡\n' +
            '\n' +
            '我住的地方距离礼士胡同不远,步行10分钟｡白天一般不在家,有事请打电话,我很快就会过来｡如果需要,我很愿意为房客提供一些关于北京旅游的建议｡房客如果有什么特别需求,可以提出,我会尽量满足您的需求｡来北京旅行的客人一般都要去八达岭长城游览,坐出租车的费用至少231元(百度地图查询)｡也可以坐火车去八达岭:在东四乘坐地铁6号线(海淀五路居方向),在平安里站下车(3站,车程约9分钟);站内换乘地铁4号线(安河桥北方向),在西直门站下车(2站,车程约5分钟)(A2西北口出),步行至北京北站(860米);乘坐市郊铁路s2线,在八达岭站下车(车程约2小时53分钟);步行至八达岭长城(1500米)｡市郊铁路s2线发车时间与车次可在网上查｡特别提示:参加八达岭一日游,一定是八达岭长城,而不是居庸关长城和水关长城｡报团参加一日游一定要找正规的旅行社｡推荐:北京中国国际旅行社(标识CITS)-网上预订中心地址:北京东城区东单北大街1-3号｡\n' +
            '\n' +
            '此处虽然距离东单､王府井这些繁华商业区很近(公共汽车两站,步行15—20分钟),胡同中依然保留着老北京市民的的生活气息,少有游客,闹中取静,生活方便｡清晨可以到北海､景山看日出,傍晚可到筒子河边欣赏故宫角楼的落日余晖,晚上可到北京人艺剧场看《茶馆》｡漫步在北京的大街小巷,品尝中国各地的风味美食｡这些体验是晚上住酒店,白天乘车直达某个旅游景点的人所无法得到的｡\n' +
            '\n' +
            '从礼士胡同43号步行约10分钟可到地铁5号线与6号线的换乘站东四站(C口 东南口),步行12分钟可到6号线与2号线的换乘站朝阳门站(H口 西南口)｡从机场到礼士胡同可以坐机场快轨到东直门站,换乘2号线到朝阳门站,出H口,向西步行约10-15分钟到朝阳门南小街,过路口(红绿灯)左转向南步行约3-5分钟即可到礼士胡同东口,再步行约3分钟即可到达礼士胡同43号｡如果从机场坐出租车,请出租车司机从礼士胡同东口进入礼士胡同(礼士胡同是单行线,汽车只能从东往西),可以在北京市财贸管理干部学院临时停车,43号院紧邻其西侧｡也可以停在礼士胡同东口,步行约3分钟即可到达礼士胡同43号｡从北京西客站到礼士胡同,可以乘地铁7号线换乘5号线,到东四站下车,出C口,沿着东四南大街向南步行约3-5分钟即可到达礼士胡同西口,向东步行约10分钟,即可到达礼士胡同43号｡从北京南站到礼士胡同,可乘坐地铁4号线换6号线,到东四站下车,出C口,沿着东四南大街向南步行约3-5分钟即可到达礼士胡同西口,向东步行约10分钟,即可到达礼士胡同43号｡从北京站到礼士胡同就更方便了,坐24路或674路公交车3或4站可直达,到演乐胡同站下车,向北步行约5分钟,到竹竿胡同路口(红绿灯),过路口就是礼士胡同｡想要游览故宫､景山､北海的朋友,可以在东四乘坐公交车((PHONE NUMBER HIDDEN)站地即达;去天坛可乘110或者地铁5号线直达;前往颐和园可乘地铁6号线再换乘地铁4号线即可｡前往南锣鼓巷､鼓楼,可在东四乘地铁6号线一站到南锣鼓巷,换8号线可到什刹海､鼓楼｡想要逛街的朋友,出礼士胡同西口就是东四南大街,向南(公共汽车两站,步行15—20分钟)即可抵达东单､王府井这些繁华商业区｡东四大街南北都是商铺､餐馆,可以慢慢逛｡想去簋街的朋友,在东四乘坐106路无轨电车可直达｡如果需要预约出租车前往首都机场,我可以帮助预约｡现在网上约车很方便,可以自行在网上预约｡需要注意的是,因为礼士胡同是在北京二环内的城区,早晚高峰易堵车,出行要考虑时间因素｡\n' +
            '\n' +
            '为保护环境,减少浪费,本店不提供一次性用品｡附近有连锁超市(朝阳门与东四都有),生活用品和食品都有,购物非常方便｡东四有麦当劳,好利来西饼屋,朝阳门内大街有必胜客外卖(汉庭酒店附近);朝阳门南小街有很多风味小吃店｡\n' +
            '特别提示:请勿把卫生纸等扔到马桶里以防堵塞下水道｡北京老城区的下水道都是几十年甚或百年前修建的｡\n' +
            '电暖气是蓄热式的,时间控制开关已经调节好了(每天晚8点至第二天早8点自动加热),请勿随意按动时间控制开关｡\n' +
            '关于地址:因为大门的门牌号码被电表箱挡住,不容易看到,特意提示一下,礼士胡同20号对面的大门就是43号｡北京东西走向的胡同,门牌编号顺序是从东向西,南侧是双号( (Website hidden by Airbnb) \n' +
            '关于价格,标明的价格是二人一晚的价格,二人以上需要加价,在额外费用中有说明,请仔细阅读｡',
          price:302,


        }
      }
    },
    components: {
      'v-header': Header
    }
  }
</script>

<style scoped>
  .info li{
    font-size: 15px;
    float: left;
    list-style: none;
    margin-right: 10px;
  }
</style>
